[
    {
        "title": "EASY Curly Crochet Braids Tutorial // invisible method + tips to minimize tangles/frizz",
        "description": "This video demonstrates how to install curly crochet braids using the invisible method. The creator shares tips for minimizing tangles and frizz, including using a specific type of hair and braiding techniques. They also discuss the importance of personal preference when it comes to hair volume and styling.",
        "tags": ["crochet braids","freetress", "easy protective styles"],
        "link": "https://youtu.be/_DjTnhcLc-w?si=EjSIfSuJBZvQr_Mq"
    },
    {
        "title":"The Perfect Beginner Wig Install | DETAILED Talk Through | Premium Lace Wigs",
        "description":"This video demonstrates a detailed beginner-friendly wig installation process. The creator walks viewers through each step, from preparing the wig cap to styling the baby hairs and curling the hair. The video includes tips for achieving a sleek and natural look, as well as product recommendations",
        "tags": ["premium lace wig","meltdown tutorial", "wig installation"],
        "link": "https://youtu.be/pmt_hfrSKys?si=EebWFUZCBJ5hSzjr"
    },
    {
        "title":"UPDATED HOW TO DO A SEW-IN ON YOURSELF | VERY DETAILED",
        "description":"A detailed step-by-step beginner friendly sew-in tutorial is here. You will learn how to do a flat braid down, and the easiest sew-in techniques for beginners and experienced beauties.",
        "tags":["sew-in","diy sew-in", "hair tutorial"],
        "link":"https://youtu.be/wg-l5ieGtHw?si=41hvpNjjajkHuZEF"
    },
    {
        "title":"Beginner's Guide To Bleaching Hair at Home! Easy to Follow + You Can Do it by Yourself",
        "description":"This video is a beginner-friendly guide to bleaching hair at home. The creator walks viewers through the process of mixing bleach and developer, applying it to the roots, and rinsing it out. They also provide tips on how to minimize damage and achieve a desired tone.",
        "tags":["bleaching hair", "afrohair tutorial", "diy hair"],
        "link":"https://youtu.be/cTKeZbcPAEM?si=y6EevUUvPcx2XSdG"
    },
    {
        "title":"No Leave-out Invisible Hairline Crochet Method/ Undetectable Hairline/ Detailed steps",
        "description": "This video demonstrates a no leave-out crochet method for achieving an invisible hairline. The creator provides detailed steps on how to install the crochet braids, including tips for creating a natural-looking hairline and minimizing tension on the scalp.",
        "tags": ["kinky afro","no leave out","undetectable hairline"],
        "link": "https://youtu.be/_Rum5-ByY90?si=hkUiIcfXD9tu2THH"
    },
    {
        "title":"Do It Yourself Ombré Quick Weave Bob | Gem Drops | STEP BY STEP",
        "description": "This video provides a step-by-step guide to creating an ombré quick weave bob hairstyle. The creator demonstrates how to apply the hair, blend the colors, and style the bob for a polished look. They also share tips on achieving a seamless blend and maintaining the style.",
        "tags":["ombre quick weave","bob hairstyle","duchess braids"],
        "link":"https://youtu.be/1Pvup6U2nks?si=Ukp6JhsrXYAolCK7"
    },
    {
        "title":"Natural Hair KINKY TO STRAIGHT ROUTINE (full body/one product!)",
        "description":"This video shows a natural hair routine for straightening kinky hair using only one product. The creator details each step, from washing and conditioning to blow drying and straightening, while emphasizing the importance of detangling and using a brush chase method. The video concludes with a demonstration of how to maintain the straightened style using pin curls.",
        "tags":["melanin haircare","conair","kinky to straight","natural hair routine"],
        "link":"https://youtu.be/fPHN__p5Pw0?si=izSlK7EEicMK4Axl"
    },
    {
        "title":"DIY silk press on type 4 hair | detailed tutorial with tips, tools + techniques",
        "description":"This video provides a detailed tutorial on how to achieve a silk press on type 4 hair. The creator shares tips, tools, and techniques for achieving a smooth and shiny finish, including the use of specific products and heat settings. They also demonstrate the entire process from washing to styling.",
        "tags": ["silk press","type 4 hair","diy silk press","natural"],
        "link":"https://youtu.be/i1WWb6qwUV8?si=RrbKkf1fcSV5yEHa"
    },
    {
        "title":"DETAILED Parting Tutorial | How To Get The Perfect Parts!",
        "description":"This video provides a detailed tutorial on how to part hair for braiding, specifically focusing on creating a brick layering effect. The instructor demonstrates their technique, offering tips and tricks for achieving crisp, even parts and ensuring that braids fall perfectly between sections.",
        "tags":["parting tutorial","brick layering","perfect parts","braiding technique"],
        "link":"https://youtu.be/birCPzu3v3U?si=X7_BiY3nK1lglW7o"
    },
    {
        "title":"Beginner Friendly: How To Achieve Braided Ponytail with Traction Alopecia" ,
        "description":"This video demonstrates a braided ponytail style for people with minimal or no edges, a common concern for those with traction alopecia. The creator shares their technique for achieving a sleek, flat ponytail using edge control, hair gel, and wrapping strips, followed by a detailed tutorial on braiding with extensions.",
        "tags":["braided ponytail","traction alopecia","minimal edges","hair tutorial"],
        "link":"https://youtu.be/2ENHb0Oobbs?si=PQ23HgE9-RcYVJ9Z"
    },
    {
        "title":"Crochet on Alopecia hair",
        "description":"The stylist demonstrates how to do crochet braids on hair affected by alopecia, focusing on techniques that minimize tension(i.e. use of a net to achieve the look) and promote a natural look. The video includes tips for selecting the right hair type and ensuring a secure installation without causing further damage to the scalp.",
        "tags":["alopecia","crochet","less tension"],
        "link":"https://youtu.be/KCR6n_uVJpg?si=IEoKu-VwH8QYRKHg"
    },
    {
        "title":"How To Cover Your Bald Thin Edges! (Traction Alopecia)",
        "description":"This is a super sensitive video for me, revealing my thin balding edges. I'm going to show you what I use in this video to cover my bald spots and put my hair in a high bun! There is hope for people that suffer from Traction Alopecia such as myself, by finding the right products that will suit you. I hope this helps someone out there!",
        "tags":["kissusa","traction alopecia","balding edges","alopecia hair transformation", "balding solution", "thin edges"],
        "link":"https://youtu.be/14viVmKp62c?si=2fziQgOgT7H0CnJe"
    },
    {
        "title":"BEST TIP for the TENDER HEADED (achieving buns and ponytails)",
        "description":"Tutorial on how to achieve a bun or ponytail for tender-headed individuals. The creator shares their technique for minimizing pain and discomfort while styling, including the use of specific products and tools to achieve a smooth finish without excessive tension on the scalp.",
        "tags":["tender headed", "soft scalp", "tension free"],
        "link":"https://youtu.be/CdN8XMf8xLY?si=Bpr-oUasYzN1RGSi"
    },
    {
        "title":"How to Detangle 4c Hair for Tender Headed little girls",
        "description":"Detangling 4c hair can be can be easy if you follow this method step by step no more ouches or tears",
        "tags":["detangling 4c hair","tender headed","black girl","little girl","4c matted hair","black hair"],
        "link":"https://youtu.be/59zf6q9-JqI?si=95It9iujMoD8UguG"
    },
    {
        "title":"Low Manipulation Styles For Tenderheaded Type 4 Naturals & No Tears",
        "description":"I got multiple comments on the first video I did with my cousin, asking have a figured out any methods to help make it easier for him. I decided to make a updated video with some tips and tricks I’ve discovered while working with his tender headed type 4 natural hair. We have gotten to the point that there are no tears during the detangling process 🙌🏾. This style is a go to, it lasts a long time, low manipulation to his scalp, and we get through the whole process with no tears. Of course I get the occasional “this hurts” but it still way better than where we started.",
        "tags":["low manipulation","men style","men braids","tender headed naturals"],
        "link":"https://youtu.be/3vxcCXzdknw?si=jFWK8Ybt9vY_nb-C"
    },
    {
        "title":"LOC RETWIST USING ALOE VERA GEL | palm rolling method",
        "description":"his my retwist routine to keep my loc babies nice & healthy  & BUILD UP FREE",
        "tags":["locced","retwist", "rolling method", "aloe vera gel"],
        "link":"https://youtu.be/W7t2edpUBAk?si=6-j6w68HDXgVAgSO"
    },
    {
        "title":"HOW TO WASH AND RETWIST STARTER/BABY LOCS ",
        "description":"This video shows an easy way to wash and retwist starter locs. The creator demonstrates the process step-by-step, including how to properly cleanse the scalp, apply products, and retwist the locs for a neat finish. They also share tips on maintaining healthy locs during the early stages of growth.",
        "tags":["starter locs","retwist","washing locs","baby locs"],
        "link":"https://youtu.be/BByHMKNOj00?si=lw7Wa5G3Hh66TqBT"
    },
    {
        "title":"Rihanna Inspired Jumbo Faux Locs Tutorial",
        "description":"This video provides a step-by-step tutorial on how to create jumbo faux locs inspired by Rihanna's hairstyle. The creator explains the materials needed, including Marley hair, shine and jam, and a styling brush, and then walks viewers through the process of creating each loc, from braiding the base to wrapping and securing the strands.",
        "tags":["rihanna","jumbo faux locs","faux locs tutorial","jumbo locs"],
        "link":"https://youtu.be/LnzO0EaBF5k?si=Xzjm1El2aPjsM9WH"
    },
    {
        "title":"NEVER Waste Money Again! DIY $4 Mini twists with X-Pression Hair",
        "description":"This video shows how to create mini twists on short 4C natural hair using X-pression hair for under $4. The creator demonstrates two different methods, one using braiding and the other using rubber bands and a crochet needle. They also share tips for maintaining the style and achieving a natural look.",
        "tags":["mini twists","4C natural hair","X-pression hair","diy mini twists"],
        "link":"https://youtu.be/BtZZeZKX4Oo?si=p2JqWACa7CVHRmXK"
    },
    {
        "title":"Fulani Mini Twists on Natural Hair | Easy Protective Style for Length Retention & Low Maintenance",
        "description":"This is a step by step tutorial on how to achieve Fulani mini twists on natural hair. The creator shares tips for maintaining the style, including how to keep the twists moisturized and protected while sleeping. They also discuss the benefits of this protective style for length retention and low maintenance.",
        "tags":["afro twist", "fulani", "mini twists", "natural hair", "protective style"],
        "link":"https://youtu.be/Xk2x3Vc9URY?si=ZxYPVXSx8ocGS9Rd"
    },
    {
        "title":"Easy hairstyles on medium and long Curly hair // protective hairstyles compilation",
        "description":"This video is a compilation of easy hairstyles for medium to long curly hair, focusing on protective styles. The creator demonstrates various techniques, including braids, buns, and twists, that help protect the hair while still looking stylish. They also share tips on how to maintain the health of curly hair while wearing these styles.",
        "tags":["penteados","curly hairstyles","90s inspired","quick hairstyles"],
        "link":"https://youtu.be/Gn3W7dcBZxA?si=OlbbZ8jscmkoXjEZ"
    },
    {
        "title":"Braids inspo compilation",
        "description":"This video is a compilation of the trendiest braids, showcasing various styles and techniques. The creator highlights different braid patterns, colors, and lengths, providing inspiration for viewers looking to try new braided hairstyles. The video includes a mix of classic and contemporary braid styles, suitable for various occasions.",
        "tags":["goddess braids","fulani braids", "boho braids", "island braids", "braids inspo"],
        "link":"https://youtu.be/fd0XDln5m2U?si=olAGnQrEFQUq8DH9"
    },
    {
        "title":"DIY Long Small Knotless Braids | Step by Step Guide How To Do Small Knotless Braids Tutorial",
        "description":"In this video, I'll be showing you how to achieve small, neat knotless braids that are perfect for 4c hair. My tutorial is designed to be easy to follow, with close-up shots and clear instructions, so you can learn at your own pace. Whether you're a beginner or an experienced braider, this video will provide you with the confidence to try knotless braids at home.",
        "tags":["knotless braids", "tutorial"],
        "link":"https://youtu.be/9UP5hKm8JE4?si=Lo0bf8kNHLlyYssl"
    },
    {
        "title":"DIY Knotless French Curl Braids Step by Step Tutorial for Beginners!!!!",
        "description":"I give tips on how to get the smoothest knotless braids and how I did the knotless french curl style from the beginning to the end and how I went about achieving this length. This whole style is used with only the french curl braiding hair and no extra hair. I hope you enjoy it, it’s a great hairstyle.",
        "tags":["french curls", "box braids", "curl braids", "diy hair"],
        "link":"https://youtu.be/6SqrCvK3zy8?si=2GCtSN42OqoDw0Iz"
    },
    {
        "title":"DIY Boho Knotless Braids ROW-BY-ROW | Full Install For Beginners ft. Waviy Hair",
        "description":"This video is a DIY boho braid tutorial going row-by-row, making it beginner-friendly. The creator uses Waviy Hair for the braids and provides detailed instructions on how to achieve the boho look, including tips on sectioning the hair, adding curls, and maintaining the style. The video is designed to help viewers create beautiful boho knotless braids at home.",
        "tags":["boho braids", "waviy hair", "box braids"],
        "link":"https://youtu.be/Pty0lGbiIBU?si=u9vwwUA3znFRiv9v"
    },
    {
        "title":"Pick and Drop Braids 2023 | Tutorial",
        "description":"From my understanding pick and drop braids have been around for a while now but this is a 2023 updated version of how the girls are doing it now",
        "tags":["2023 hair inspo","pick and drop braids","braids tutorial", "curly braids", "bohemian braids"],
        "link":"https://youtu.be/desI3Vo_SQs?si=CYktjyBYbqkwqLxH"
    },
    {
        "title":"Mermaid Braids ft. YWigs Bulk Hair | Tutorial",
        "description":"This video shows how to achieve mermaid braids using bulk hair. The creator demonstrates how to braid the hair, including tips for sectioning and adding bulk hair. They also show how to dip the braids in boiling water to set the curls. The video is geared towards those who already know how to braid, but want to learn how to achieve a specific mermaid braid look.",
        "tags":["human hair","bohemian braids","mermaid braids","ywigs hair"],
        "link":"https://youtu.be/rQg4crfFOgY?si=Gu7INElMSfJLavMQ"
    },
    {
        "title":"Handmade Loc Tutorial | Glueless & Weftless Method | Beginner Friendly Mermaid Locs",
        "description":"Watch me create these handmade locs with human hair!! This tutorial is beginner friendly for those wanting to create locs."
,        "tags":["diy locs","handmade locs","mermaid locs","boho locs"],
        "link":"https://youtu.be/fSnYCc2ubRw?si=jbWtQuLwCaTKnrsM"
    },
    {
        "title":"JAH LOCS FAUX LOCS, USING 3 BUNDLES | EASY STEP-BY-STEP TUTORIAL | PROTECTIVE STYLE",
        "description":"This video entails a step-by-step tutorial on how to create Jah Locs/faux locs using three bundles of hair. The creator demonstrates the entire process, from sectioning the hair to wrapping the locs, and provides tips for achieving a natural look. The video is designed to be beginner-friendly and emphasizes the protective nature of the style.",
        "tags":["jah locs","faux locs","protective style","easy tutorial"],
        "link":"https://youtu.be/xPXoNaQ-JAQ?si=wRsx5AZqwJf_m8D8"
    },
    {
        "title":"How To Wash Braids | No Frizz No Dry Scalp Fast Drying",
        "description":"This video demonstrates a method for washing braids without soaking the entire head. The technique focuses on cleaning the scalp and roots, minimizing frizz and dryness. The video includes a step-by-step guide, showcasing how to create a loose bun, use a shower head to target the scalp, and apply hair oil and mousse to refresh the hairline.",
        "tags":["wash day","braids","no frizz","braid wash"],
        "link":"https://youtu.be/q3pu-HG7JjI?si=TNUgKr5nGsDNrYs4"
    },
    {
        "title":"Brushing My Locs and How I Manage Seborrheic Dermatitis",
        "description":"This video shows the hair/loc care routine of a person with eczema and seborrheic dermatitis. The creator demonstrates how they brush their locs to manage the condition, including the use of specific products to soothe the scalp and prevent flaking. They also share tips on maintaining healthy locs while dealing with these skin conditions.",
        "tags":["locs","seborrheic dermatitis","scalp care","hair care"],
        "link":"https://youtu.be/IML44I7gcz4?si=uKJWeJort2KAVIsr"
    },
    {
        "title":"Combing out loc ends (curly locs)",
        "description":"This video shows the process of combing out the ends of curly locs to achieve a more defined curl pattern. The creator demonstrates their technique, including the use of specific products and tools to gently detangle the locs without causing damage. They also share tips on how to maintain healthy curls after combing out the locs.",
        "tags":["curly locs","loc ends","diy locs","hair care"],
        "link":"https://youtu.be/ZIAKM2QL9kc?si=3S7jdpmDtccL66El"
    },
    {
        "title":"I’M BACK! DIY boneless/knotless braids| SCALP PSORIASIS| Sulfur 8 treatment| 4C hair",
        "description":"In this video, I’m doing my hair and sharing a sectioning method I came across on YouTube that’s been a game-changer. Plus, I’ll show you exactly what helped me get rid of my excessive dry scalp!",
        "tags":["boneless braids","knotless braids","scalp psoriasis","sulfur 8 treatment","4C hair"],
        "link":"https://youtu.be/eCEAcO9rRNs?si=0ON0haINNxbX7hiU"
    },
    {
        "title":"HOW TO: KNOTLESS BOB TUTORIAL *VERY DETAILED* IHAIRDIARESS",
        "description":"This video is a detailed tutorial on how to create a knotless bob hairstyle. The creator demonstrates how to prepare the hair, section it, braid, and curl it. They also provide tips on how to add curly hair extensions and trim the final style.",
        "tags":["knotless bob","bob tutorial","detailed tutorial","iHairDiaress"],
        "link":"https://youtu.be/QwCyXaHvL98?si=mGfHQbMQGtznQSs5"
    },
    {
        "title":"022|HOW TO: DIY THE PERFECT FULANI FLIP-OVER BOB!| EASY STITCH BRAIDS TUTORIAL + MORE FT. Ywigs",
        "description":"This video shows an easy, step by step tutorial on how to achieve a Fulani flip-over bob hairstyle with stitch braids. The creator uses Ywigs hair and provides detailed instructions on how to section the hair, braid it, and style the bob. The video is designed to be beginner-friendly and includes tips for achieving a polished look.",
        "tags":["boho braids","fulani braids","flip-over bob","stitch braids tutorial","Ywigs"],
        "link":"https://youtu.be/NbouoiUlwy4?si=tWzmcEK_VRhFbWxN"
    }
]